// 18_1
let a1 = 10;
let b1 = 2;

alert(a1+b1)
alert(a1-b1)
alert(a1*b1)
alert(a1/b1)

// 18_2
let c = 10;
let d = 5;
let result= c + d;

alert(result)

// 18_3
let a3 = 1;
let b3 = 2;
let c3 = 3;

alert(a3+b3+c3)

// 18_4
let a4 = 10;
let b4 = 5;
let c4 = a4 - b4;
let d4 = 7;
let result1 = c4 + d4;

alert(result1);

/*  
__________________
19_1

let a = 5 + 5 * 3;
alert(a);

ОТВЕТ: 20
__________________
19_2

let a = 5 + 5 * 3 + 3;
alert(a);

ОТВЕТ: 23
__________________
19_3

let a = 8 / 2 + 2;
alert(a);

ОТВЕТ: 6
__________________
19_4

let a = 8 + 2 / 2;
alert(a);

ОТВЕТ: 9
__________________
20_1

let a = 8 / 2 * 2;
alert(a);

ОТВЕТ: 8
__________________
20_2

let a = 8 * 4 / 2 / 2;
alert(a);

ОТВЕТ: 8
__________________
21_1

let a = (2 + 3) * (2 + 3);
alert(a);

ОТВЕТ: 25
__________________
21_2

let a = (2 + 3) * 2 + 3;
alert(a);

ОТВЕТ: 13
__________________
21_3

let a = 2 * (2 + 4 * (3 + 1));
alert(a);

ОТВЕТ: 36
__________________
21_4

let a = 2 * 8 / 4;
alert(a);

ОТВЕТ: 4
__________________
21_5

let a = (2 * 8) / 4;
alert(a);

ОТВЕТ: 4
__________________
21_6

let a = 2 * (8 / 4);
alert(a);

ОТВЕТ: 4
*/

//22
let a  = 1.5; b = 0.75;
alert(a+b);

//23